In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('iris.csv')

In [5]:
df.isnull().sum()

sepal.length    0
sepal.width     0
petal.length    0
petal.width     0
variety         0
dtype: int64

In [7]:
df.mean(numeric_only=True)

sepal.length    5.843333
sepal.width     3.057333
petal.length    3.758000
petal.width     1.199333
dtype: float64

In [10]:
df['variety'].value_counts()

Setosa        50
Versicolor    50
Virginica     50
Name: variety, dtype: int64

In [11]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [16]:
versicolor = df.loc[df.variety == 'Versicolor']

In [17]:
versicolor.std(numeric_only = True)

sepal.length    0.516171
sepal.width     0.313798
petal.length    0.469911
petal.width     0.197753
dtype: float64

In [18]:
versicolor.var(numeric_only = True)

sepal.length    0.266433
sepal.width     0.098469
petal.length    0.220816
petal.width     0.039106
dtype: float64

In [20]:
versicolor.quantile(0.25,numeric_only = True)

sepal.length    5.600
sepal.width     2.525
petal.length    4.000
petal.width     1.200
Name: 0.25, dtype: float64

In [21]:
versicolor.quantile(0.75,numeric_only = True)

sepal.length    6.3
sepal.width     3.0
petal.length    4.6
petal.width     1.5
Name: 0.75, dtype: float64

In [23]:
versicolor.mean(numeric_only = True)

sepal.length    5.936
sepal.width     2.770
petal.length    4.260
petal.width     1.326
dtype: float64

In [24]:
versicolor.median(numeric_only = True)

sepal.length    5.90
sepal.width     2.80
petal.length    4.35
petal.width     1.30
dtype: float64

In [29]:
versicolor.mode()

   sepal.length  sepal.width  petal.length  petal.width     variety
0           5.5          3.0           4.5          1.3  Versicolor
1           5.6          NaN           NaN          NaN         NaN
2           5.7          NaN           NaN          NaN         NaN

In [30]:
import seaborn as sns

In [31]:
df = sns.load_dataset('tips')

In [32]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [35]:
df.groupby('sex').agg('min','max')

        total_bill  tip  size
sex
Male          7.25  1.0     1
Female        3.07  1.0     1

In [37]:
df['tip'].mean()

2.99827868852459

In [39]:
df.loc[:,'tip'].mean()

2.99827868852459

In [40]:
from sklearn import datasets

In [42]:
iris = datasets.load_iris()

In [43]:
df = pd.DataFrame(iris['data'])

In [44]:
df.head()

     0    1    2    3
0  5.1  3.5  1.4  0.2
1  4.9  3.0  1.4  0.2
2  4.7  3.2  1.3  0.2
3  4.6  3.1  1.5  0.2
4  5.0  3.6  1.4  0.2

In [45]:
df[4]=iris['target']

In [46]:
df.head()

     0    1    2    3  4
0  5.1  3.5  1.4  0.2  0
1  4.9  3.0  1.4  0.2  0
2  4.7  3.2  1.3  0.2  0
3  4.6  3.1  1.5  0.2  0
4  5.0  3.6  1.4  0.2  0

In [47]:
df.rename(columns={0:'Simran'},inplace = True)

In [48]:
df.head()

   Simran    1    2    3  4
0     5.1  3.5  1.4  0.2  0
1     4.9  3.0  1.4  0.2  0
2     4.7  3.2  1.3  0.2  0
3     4.6  3.1  1.5  0.2  0
4     5.0  3.6  1.4  0.2  0

In [49]:
df['Simran'].mean()

5.843333333333334